import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

data = {
    "Длина": [1000, 2000, 3000, 4000, 5000, 6000, 7000, 8000, 9000, 10000],
    "последовательньй": [13, 57, 127, 264, 434, 636, 948, 1347, 1516, 1710],
    "2 потока": [7, 31, 65, 140, 245, 367, 610, 769, 930, 1093],
    "4 потока": [4, 15, 48, 111, 182, 268, 411, 618, 687, 741],
    "8 потоков": [3, 13, 55, 92, 162, 240, 356, 443, 553, 698],
    "16 потоков": [3, 13, 56, 100, 164, 243, 358, 480, 607, 816],
    "32 потока" : [4, 13, 61, 103, 166, 244, 370, 496, 732, 878],
}


markers = ['o', 's', '^', 'D', 'x']

# Создание DataFrame из данных
df = pd.DataFrame(data)

# Отрисовка графиков
plt.figure(figsize=(12, 6))

k = 0
# Добавление графиков для каждой колонки
for i, column in enumerate(df.columns[1:]):
    k = i % len(markers) 
    plt.plot(df['Длина'], df[column], label=column, marker = markers[k])

# Настройка легенды и заголовка
plt.legend(loc='upper left')
plt.title('График зависимости времени выполнения от размерности матрицы')
plt.xlabel('Размерность')
plt.ylabel('Время выполнения (мc)')

# Отображение графика
plt.show()

