import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

# # Данные
# data = {
#     'Длина' : [1, 2, 3, 4, 5, 6, 7, 8, 9, 10],
#     'НерекурсивныйЛ' :  [600, 700, 700, 1000, 3300, 1700, 2200, 1500, 1400, 2300],
#     'НерекурсивныйДЛ' : [500, 500, 700, 900, 600, 1400, 900, 3300, 1400, 1100],
#     'Рекурсивный с кэшем ДЛ' : [500, 600, 2600, 1500, 1100, 3200, 2300, 3700, 2900, 3100],
#     "РекурсивныйДЛ": [10, 1000, 2000, 6000, 20000, 124000, 568000, 2881000, 13157000, 44023000],
# }

# data = {
#     "Длина": [100, 200, 300, 400, 500, 600, 700, 800, 900, 1000],
#     "НерекурсивныйЛ": [61400, 251900, 497800, 904100, 1482400, 1669200, 2655800, 3376800, 4764800, 5223500],
#     "НерекурсивныйДЛ": [101100, 286700, 572900, 1165600, 1206200, 1896700, 2774200, 3298500, 4630900, 5185000],
#     'Рекурсивный с кэшем ДЛ' : [193400, 894300, 2233400, 4419400, 5922400, 9061400, 12027300, 17409200, 21684300, 23762900],
# }

data = {
    "Длина": [100, 200, 300, 400, 500, 600, 700, 800, 900, 1000],
    "НерекурсивныйЛ": [61, 251, 497, 904, 1482, 1669, 2655, 3376, 4764, 5223],
    "НерекурсивныйДЛ": [101, 286, 572, 1165, 1206, 1896, 2774, 3298, 4630, 5185],
    'Рекурсивный с кэшем ДЛ' : [193, 894, 2233, 4419, 5922, 9061, 12027, 17409, 21684, 23762],
}

markers = ['o', 's', '^', 'D', 'x']

# Создание DataFrame из данных
df = pd.DataFrame(data)

# Отрисовка графиков
plt.figure(figsize=(12, 6))

k = 0
# Добавление графиков для каждой колонки
for i, column in enumerate(df.columns[1:]):
    plt.plot(df['Длина'], df[column], label=column, marker = markers[i])

# Настройка легенды и заголовка
plt.legend(loc='upper left')
plt.title('График зависимости времени выполнения от Длины')
plt.xlabel('Длина')
plt.ylabel('Время выполнения (мкс)')

plt.yscale('log')

# Отображение графика
plt.show()

